; domain
(define (domain fleet_domain)
  (:requirements :typing)
  (:types quad observer location)
  (:predicates
    (at_quad ?q - quad ?loc - location)
    (at_obs ?o - observer ?loc - location)
    (adjacent ?loc1 - location ?loc2 - location)
    (target ?loc - location)
  )
  (:action move_quad
    :parameters (?q - quad ?from - location ?to - location)
    :precondition (and (at_quad ?q ?from) (adjacent ?from ?to))
    :effect (and (not (at_quad ?q ?from)) (at_quad ?q ?to))
  )
  (:action move_obs
    :parameters (?o - observer ?from - location ?to - location)
    :precondition (and (at_obs ?o ?from) (adjacent ?from ?to))
    :effect (and (not (at_obs ?o ?from)) (at_obs ?o ?to))
  )
)

; problem
(define (problem quad_problem)
(:domain fleet_domain)
(:objects
quad_0 - quad
obs_0 - observer
c0_0 c0_1 c0_2 c0_3 c0_4 c0_5 c0_6 c0_7 c0_8 c0_9 c1_0 c1_1 c1_2 c1_3 c1_4 c1_5 c1_6 c1_7 c1_8 c1_9 c2_0 c2_1 c2_2 c2_3 c2_4 c2_5 c2_6 c2_7 c2_8 c2_9 c3_0 c3_1 c3_2 c3_3 c3_4 c3_5 c3_6 c3_7 c3_8 c3_9 c4_0 c4_1 c4_2 c4_3 c4_4 c4_5 c4_6 c4_7 c4_8 c4_9 c5_0 c5_1 c5_2 c5_3 c5_4 c5_5 c5_6 c5_7 c5_8 c5_9 c6_0 c6_1 c6_2 c6_3 c6_4 c6_5 c6_6 c6_7 c6_8 c6_9 c7_0 c7_1 c7_2 c7_3 c7_4 c7_5 c7_6 c7_7 c7_8 c7_9 c8_0 c8_1 c8_2 c8_3 c8_4 c8_5 c8_6 c8_7 c8_8 c8_9 c9_0 c9_1 c9_2 c9_3 c9_4 c9_5 c9_6 c9_7 c9_8 c9_9 - location
)
(:init
(at_quad quad_0 c3_8)
(at_obs obs_0 c6_1)
(target c4_4)
(adjacent c0_0 c1_0)
(adjacent c0_0 c0_1)
(adjacent c0_1 c1_1)
(adjacent c0_1 c0_0)
(adjacent c0_1 c0_2)
(adjacent c0_2 c1_2)
(adjacent c0_2 c0_1)
(adjacent c0_2 c0_3)
(adjacent c0_3 c1_3)
(adjacent c0_3 c0_2)
(adjacent c0_3 c0_4)
(adjacent c0_4 c1_4)
(adjacent c0_4 c0_3)
(adjacent c0_4 c0_5)
(adjacent c0_5 c1_5)
(adjacent c0_5 c0_4)
(adjacent c0_5 c0_6)
(adjacent c0_6 c1_6)
(adjacent c0_6 c0_5)
(adjacent c0_6 c0_7)
(adjacent c0_7 c1_7)
(adjacent c0_7 c0_6)
(adjacent c0_7 c0_8)
(adjacent c0_8 c1_8)
(adjacent c0_8 c0_7)
(adjacent c0_8 c0_9)
(adjacent c0_9 c1_9)
(adjacent c0_9 c0_8)
(adjacent c1_0 c0_0)
(adjacent c1_0 c2_0)
(adjacent c1_0 c1_1)
(adjacent c1_1 c0_1)
(adjacent c1_1 c2_1)
(adjacent c1_1 c1_0)
(adjacent c1_1 c1_2)
(adjacent c1_2 c0_2)
(adjacent c1_2 c2_2)
(adjacent c1_2 c1_1)
(adjacent c1_2 c1_3)
(adjacent c1_3 c0_3)
(adjacent c1_3 c2_3)
(adjacent c1_3 c1_2)
(adjacent c1_3 c1_4)
(adjacent c1_4 c0_4)
(adjacent c1_4 c2_4)
(adjacent c1_4 c1_3)
(adjacent c1_4 c1_5)
(adjacent c1_5 c0_5)
(adjacent c1_5 c2_5)
(adjacent c1_5 c1_4)
(adjacent c1_5 c1_6)
(adjacent c1_6 c0_6)
(adjacent c1_6 c2_6)
(adjacent c1_6 c1_5)
(adjacent c1_6 c1_7)
(adjacent c1_7 c0_7)
(adjacent c1_7 c2_7)
(adjacent c1_7 c1_6)
(adjacent c1_7 c1_8)
(adjacent c1_8 c0_8)
(adjacent c1_8 c2_8)
(adjacent c1_8 c1_7)
(adjacent c1_8 c1_9)
(adjacent c1_9 c0_9)
(adjacent c1_9 c2_9)
(adjacent c1_9 c1_8)
(adjacent c2_0 c1_0)
(adjacent c2_0 c3_0)
(adjacent c2_0 c2_1)
(adjacent c2_1 c1_1)
(adjacent c2_1 c3_1)
(adjacent c2_1 c2_0)
(adjacent c2_1 c2_2)
(adjacent c2_2 c1_2)
(adjacent c2_2 c3_2)
(adjacent c2_2 c2_1)
(adjacent c2_2 c2_3)
(adjacent c2_3 c1_3)
(adjacent c2_3 c3_3)
(adjacent c2_3 c2_2)
(adjacent c2_3 c2_4)
(adjacent c2_4 c1_4)
(adjacent c2_4 c3_4)
(adjacent c2_4 c2_3)
(adjacent c2_4 c2_5)
(adjacent c2_5 c1_5)
(adjacent c2_5 c3_5)
(adjacent c2_5 c2_4)
(adjacent c2_5 c2_6)
(adjacent c2_6 c1_6)
(adjacent c2_6 c3_6)
(adjacent c2_6 c2_5)
(adjacent c2_6 c2_7)
(adjacent c2_7 c1_7)
(adjacent c2_7 c3_7)
(adjacent c2_7 c2_6)
(adjacent c2_7 c2_8)
(adjacent c2_8 c1_8)
(adjacent c2_8 c3_8)
(adjacent c2_8 c2_7)
(adjacent c2_8 c2_9)
(adjacent c2_9 c1_9)
(adjacent c2_9 c3_9)
(adjacent c2_9 c2_8)
(adjacent c3_0 c2_0)
(adjacent c3_0 c4_0)
(adjacent c3_0 c3_1)
(adjacent c3_1 c2_1)
(adjacent c3_1 c4_1)
(adjacent c3_1 c3_0)
(adjacent c3_1 c3_2)
(adjacent c3_2 c2_2)
(adjacent c3_2 c4_2)
(adjacent c3_2 c3_1)
(adjacent c3_2 c3_3)
(adjacent c3_3 c2_3)
(adjacent c3_3 c4_3)
(adjacent c3_3 c3_2)
(adjacent c3_3 c3_4)
(adjacent c3_4 c2_4)
(adjacent c3_4 c4_4)
(adjacent c3_4 c3_3)
(adjacent c3_4 c3_5)
(adjacent c3_5 c2_5)
(adjacent c3_5 c4_5)
(adjacent c3_5 c3_4)
(adjacent c3_5 c3_6)
(adjacent c3_6 c2_6)
(adjacent c3_6 c4_6)
(adjacent c3_6 c3_5)
(adjacent c3_6 c3_7)
(adjacent c3_7 c2_7)
(adjacent c3_7 c4_7)
(adjacent c3_7 c3_6)
(adjacent c3_7 c3_8)
(adjacent c3_8 c2_8)
(adjacent c3_8 c4_8)
(adjacent c3_8 c3_7)
(adjacent c3_8 c3_9)
(adjacent c3_9 c2_9)
(adjacent c3_9 c4_9)
(adjacent c3_9 c3_8)
(adjacent c4_0 c3_0)
(adjacent c4_0 c5_0)
(adjacent c4_0 c4_1)
(adjacent c4_1 c3_1)
(adjacent c4_1 c5_1)
(adjacent c4_1 c4_0)
(adjacent c4_1 c4_2)
(adjacent c4_2 c3_2)
(adjacent c4_2 c5_2)
(adjacent c4_2 c4_1)
(adjacent c4_2 c4_3)
(adjacent c4_3 c3_3)
(adjacent c4_3 c5_3)
(adjacent c4_3 c4_2)
(adjacent c4_3 c4_4)
(adjacent c4_4 c3_4)
(adjacent c4_4 c5_4)
(adjacent c4_4 c4_3)
(adjacent c4_4 c4_5)
(adjacent c4_5 c3_5)
(adjacent c4_5 c5_5)
(adjacent c4_5 c4_4)
(adjacent c4_5 c4_6)
(adjacent c4_6 c3_6)
(adjacent c4_6 c5_6)
(adjacent c4_6 c4_5)
(adjacent c4_6 c4_7)
(adjacent c4_7 c3_7)
(adjacent c4_7 c5_7)
(adjacent c4_7 c4_6)
(adjacent c4_7 c4_8)
(adjacent c4_8 c3_8)
(adjacent c4_8 c5_8)
(adjacent c4_8 c4_7)
(adjacent c4_8 c4_9)
(adjacent c4_9 c3_9)
(adjacent c4_9 c5_9)
(adjacent c4_9 c4_8)
(adjacent c5_0 c4_0)
(adjacent c5_0 c6_0)
(adjacent c5_0 c5_1)
(adjacent c5_1 c4_1)
(adjacent c5_1 c6_1)
(adjacent c5_1 c5_0)
(adjacent c5_1 c5_2)
(adjacent c5_2 c4_2)
(adjacent c5_2 c6_2)
(adjacent c5_2 c5_1)
(adjacent c5_2 c5_3)
(adjacent c5_3 c4_3)
(adjacent c5_3 c6_3)
(adjacent c5_3 c5_2)
(adjacent c5_3 c5_4)
(adjacent c5_4 c4_4)
(adjacent c5_4 c6_4)
(adjacent c5_4 c5_3)
(adjacent c5_4 c5_5)
(adjacent c5_5 c4_5)
(adjacent c5_5 c6_5)
(adjacent c5_5 c5_4)
(adjacent c5_5 c5_6)
(adjacent c5_6 c4_6)
(adjacent c5_6 c6_6)
(adjacent c5_6 c5_5)
(adjacent c5_6 c5_7)
(adjacent c5_7 c4_7)
(adjacent c5_7 c6_7)
(adjacent c5_7 c5_6)
(adjacent c5_7 c5_8)
(adjacent c5_8 c4_8)
(adjacent c5_8 c6_8)
(adjacent c5_8 c5_7)
(adjacent c5_8 c5_9)
(adjacent c5_9 c4_9)
(adjacent c5_9 c6_9)
(adjacent c5_9 c5_8)
(adjacent c6_0 c5_0)
(adjacent c6_0 c7_0)
(adjacent c6_0 c6_1)
(adjacent c6_1 c5_1)
(adjacent c6_1 c7_1)
(adjacent c6_1 c6_0)
(adjacent c6_1 c6_2)
(adjacent c6_2 c5_2)
(adjacent c6_2 c7_2)
(adjacent c6_2 c6_1)
(adjacent c6_2 c6_3)
(adjacent c6_3 c5_3)
(adjacent c6_3 c7_3)
(adjacent c6_3 c6_2)
(adjacent c6_3 c6_4)
(adjacent c6_4 c5_4)
(adjacent c6_4 c7_4)
(adjacent c6_4 c6_3)
(adjacent c6_4 c6_5)
(adjacent c6_5 c5_5)
(adjacent c6_5 c7_5)
(adjacent c6_5 c6_4)
(adjacent c6_5 c6_6)
(adjacent c6_6 c5_6)
(adjacent c6_6 c7_6)
(adjacent c6_6 c6_5)
(adjacent c6_6 c6_7)
(adjacent c6_7 c5_7)
(adjacent c6_7 c7_7)
(adjacent c6_7 c6_6)
(adjacent c6_7 c6_8)
(adjacent c6_8 c5_8)
(adjacent c6_8 c7_8)
(adjacent c6_8 c6_7)
(adjacent c6_8 c6_9)
(adjacent c6_9 c5_9)
(adjacent c6_9 c7_9)
(adjacent c6_9 c6_8)
(adjacent c7_0 c6_0)
(adjacent c7_0 c8_0)
(adjacent c7_0 c7_1)
(adjacent c7_1 c6_1)
(adjacent c7_1 c8_1)
(adjacent c7_1 c7_0)
(adjacent c7_1 c7_2)
(adjacent c7_2 c6_2)
(adjacent c7_2 c8_2)
(adjacent c7_2 c7_1)
(adjacent c7_2 c7_3)
(adjacent c7_3 c6_3)
(adjacent c7_3 c8_3)
(adjacent c7_3 c7_2)
(adjacent c7_3 c7_4)
(adjacent c7_4 c6_4)
(adjacent c7_4 c8_4)
(adjacent c7_4 c7_3)
(adjacent c7_4 c7_5)
(adjacent c7_5 c6_5)
(adjacent c7_5 c8_5)
(adjacent c7_5 c7_4)
(adjacent c7_5 c7_6)
(adjacent c7_6 c6_6)
(adjacent c7_6 c8_6)
(adjacent c7_6 c7_5)
(adjacent c7_6 c7_7)
(adjacent c7_7 c6_7)
(adjacent c7_7 c8_7)
(adjacent c7_7 c7_6)
(adjacent c7_7 c7_8)
(adjacent c7_8 c6_8)
(adjacent c7_8 c8_8)
(adjacent c7_8 c7_7)
(adjacent c7_8 c7_9)
(adjacent c7_9 c6_9)
(adjacent c7_9 c8_9)
(adjacent c7_9 c7_8)
(adjacent c8_0 c7_0)
(adjacent c8_0 c9_0)
(adjacent c8_0 c8_1)
(adjacent c8_1 c7_1)
(adjacent c8_1 c9_1)
(adjacent c8_1 c8_0)
(adjacent c8_1 c8_2)
(adjacent c8_2 c7_2)
(adjacent c8_2 c9_2)
(adjacent c8_2 c8_1)
(adjacent c8_2 c8_3)
(adjacent c8_3 c7_3)
(adjacent c8_3 c9_3)
(adjacent c8_3 c8_2)
(adjacent c8_3 c8_4)
(adjacent c8_4 c7_4)
(adjacent c8_4 c9_4)
(adjacent c8_4 c8_3)
(adjacent c8_4 c8_5)
(adjacent c8_5 c7_5)
(adjacent c8_5 c9_5)
(adjacent c8_5 c8_4)
(adjacent c8_5 c8_6)
(adjacent c8_6 c7_6)
(adjacent c8_6 c9_6)
(adjacent c8_6 c8_5)
(adjacent c8_6 c8_7)
(adjacent c8_7 c7_7)
(adjacent c8_7 c9_7)
(adjacent c8_7 c8_6)
(adjacent c8_7 c8_8)
(adjacent c8_8 c7_8)
(adjacent c8_8 c9_8)
(adjacent c8_8 c8_7)
(adjacent c8_8 c8_9)
(adjacent c8_9 c7_9)
(adjacent c8_9 c9_9)
(adjacent c8_9 c8_8)
(adjacent c9_0 c8_0)
(adjacent c9_0 c9_1)
(adjacent c9_1 c8_1)
(adjacent c9_1 c9_0)
(adjacent c9_1 c9_2)
(adjacent c9_2 c8_2)
(adjacent c9_2 c9_1)
(adjacent c9_2 c9_3)
(adjacent c9_3 c8_3)
(adjacent c9_3 c9_2)
(adjacent c9_3 c9_4)
(adjacent c9_4 c8_4)
(adjacent c9_4 c9_3)
(adjacent c9_4 c9_5)
(adjacent c9_5 c8_5)
(adjacent c9_5 c9_4)
(adjacent c9_5 c9_6)
(adjacent c9_6 c8_6)
(adjacent c9_6 c9_5)
(adjacent c9_6 c9_7)
(adjacent c9_7 c8_7)
(adjacent c9_7 c9_6)
(adjacent c9_7 c9_8)
(adjacent c9_8 c8_8)
(adjacent c9_8 c9_7)
(adjacent c9_8 c9_9)
(adjacent c9_9 c8_9)
(adjacent c9_9 c9_8)
)
(:goal
(at_quad quad_0 c4_4)
)
)

; plan
1. (move_quad quad_0 c3_8 c3_7)
   deleted: (at_quad quad_0 c3_8)
   added: (at_quad quad_0 c3_7)
   goals met: 0 of 1
2. (move_quad quad_0 c3_7 c3_6)
   deleted: (at_quad quad_0 c3_7)
   added: (at_quad quad_0 c3_6)
   goals met: 0 of 1
3. (move_quad quad_0 c3_6 c3_5)
   deleted: (at_quad quad_0 c3_6)
   added: (at_quad quad_0 c3_5)
   goals met: 0 of 1
4. (move_quad quad_0 c3_5 c3_4)
   deleted: (at_quad quad_0 c3_5)
   added: (at_quad quad_0 c3_4)
   goals met: 0 of 1
5. (move_quad quad_0 c3_4 c4_4)
   deleted: (at_quad quad_0 c3_4)
   added: (at_quad quad_0 c4_4)
   goals met: 1 of 1
